RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_lptim16.h
/**
  * @brief    Set Input Capture Channel Capture Edge
  * @rmtoll   CCSR    CAPCFG    FL_LPTIM16_IC_SetCaptureEdge
  * @param    LPTIM16x LPTIM16 instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_IC_EDGE_RISING
  *           @arg @ref FL_LPTIM16_IC_EDGE_FALLING
  *           @arg @ref FL_LPTIM16_IC_EDGE_BOTH
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   None
  */
__STATIC_INLINE void FL_LPTIM16_IC_SetCaptureEdge(LPTIM16_Type *LPTIM16x, uint32_t polarity, uint32_t channel)
{
    switch(channel)
    {
        case FL_LPTIM16_CHANNEL_1:
            MODIFY_REG(LPTIM16x->CCSR, (0x3U << 8U), (polarity << 0U));
            break;
        case FL_LPTIM16_CHANNEL_2:
            MODIFY_REG(LPTIM16x->CCSR, (0x3U << 10U), (polarity << 2U));
            break;
    }
}

/**
  * @brief    Get Input Capture Channel Capture Edge
  * @rmtoll   CCSR    CAPCFG    FL_LPTIM16_IC_GetCaptureEdge
  * @param    LPTIM16x LPTIM16 instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LPTIM16_IC_EDGE_RISING
  *           @arg @ref FL_LPTIM16_IC_EDGE_FALLING
  *           @arg @ref FL_LPTIM16_IC_EDGE_BOTH
  */
__STATIC_INLINE uint32_t FL_LPTIM16_IC_GetCaptureEdge(LPTIM16_Type *LPTIM16x, uint32_t channel)
{
    switch(channel)
    {
        case FL_LPTIM16_CHANNEL_1:
            return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x3U << 8U)) >> 0U);
        case FL_LPTIM16_CHANNEL_2:
            return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x3U << 10U)) >> 2U);
        default:
            return 0;
    }
}

/**
  * @brief    Set Channel Output Compare Polarity
  * @rmtoll   CCSR    CCP    FL_LPTIM16_OC_SetPolarity
  * @param    LPTIM16x LPTIM16 instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_OC_POLARITY_NORMAL
  *           @arg @ref FL_LPTIM16_OC_POLARITY_INVERT
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   None
  */
__STATIC_INLINE void FL_LPTIM16_OC_SetPolarity(LPTIM16_Type *LPTIM16x, uint32_t polarity, uint32_t channel)
{
    switch(channel)
    {
        case FL_LPTIM16_CHANNEL_1:
            MODIFY_REG(LPTIM16x->CCSR, (0x1U << 16U), (polarity << 0U));
            break;
        case FL_LPTIM16_CHANNEL_2:
            MODIFY_REG(LPTIM16x->CCSR, (0x1U << 17U), (polarity << 1U));
            break;
    }
}

/**
  * @brief    Get Channel Output Compare Polarity
  * @rmtoll   CCSR    CCP    FL_LPTIM16_OC_GetPolarity
  * @param    LPTIM16x LPTIM16 instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LPTIM16_OC_POLARITY_NORMAL
  *           @arg @ref FL_LPTIM16_OC_POLARITY_INVERT
  */
__STATIC_INLINE uint32_t FL_LPTIM16_OC_GetPolarity(LPTIM16_Type *LPTIM16x, uint32_t channel)
{
    switch(channel)
    {
        case FL_LPTIM16_CHANNEL_1:
            return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 16U)) >> 0U);
        case FL_LPTIM16_CHANNEL_2:
            return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 17U)) >> 1U);
        default:
            return 0;
    }
}

/**
  * @brief    Set Input Capture Channel Input Polarity
  * @rmtoll   CCSR    CCP    FL_LPTIM16_IC_SetInputPolarity
  * @param    LPTIM16x LPTIM16 instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_IC_POLARITY_NORMAL
  *           @arg @ref FL_LPTIM16_IC_POLARITY_INVERT
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   None
  */
__STATIC_INLINE void FL_LPTIM16_IC_SetInputPolarity(LPTIM16_Type *LPTIM16x, uint32_t polarity, uint32_t channel)
{
    switch(channel)
    {
        case FL_LPTIM16_CHANNEL_1:
            MODIFY_REG(LPTIM16x->CCSR, (0x1U << 16U), (polarity << 0U));
            break;
        case FL_LPTIM16_CHANNEL_2:
            MODIFY_REG(LPTIM16x->CCSR, (0x1U << 17U), (polarity << 1U));
            break;
    }
}

/**
  * @brief    Get Input Capture Channel Input Polarity
  * @rmtoll   CCSR    CCP    FL_LPTIM16_IC_GetInputPolarity
  * @param    LPTIM16x LPTIM16 instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LPTIM16_IC_POLARITY_NORMAL
  *           @arg @ref FL_LPTIM16_IC_POLARITY_INVERT
  */
__STATIC_INLINE uint32_t FL_LPTIM16_IC_GetInputPolarity(LPTIM16_Type *LPTIM16x, uint32_t channel)
{
    switch(channel)
    {
        case FL_LPTIM16_CHANNEL_1:
            return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 16U)) >> 0U);
        case FL_LPTIM16_CHANNEL_2:
            return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 17U)) >> 1U);
        default:
            return 0;
    }
}

/**
  * @brief    Enable Channel Input Digital Filter
  * @rmtoll   CCSR        FL_LPTIM16_EnableDigitalFilter
  * @param    LPTIM16x LPTIM16 instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   None
  */
__STATIC_INLINE void FL_LPTIM16_EnableDigitalFilter(LPTIM16_Type *LPTIM16x, uint32_t channel)
{
    SET_BIT(LPTIM16x->CCSR, ((channel & 0x3) << 0xcU));
}

/**
  * @brief    Disable Channel Input Digital Filter
  * @rmtoll   CCSR        FL_LPTIM16_DisableDigitalFilter
  * @param    LPTIM16x LPTIM16 instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   None
  */
__STATIC_INLINE void FL_LPTIM16_DisableDigitalFilter(LPTIM16_Type *LPTIM16x, uint32_t channel)
{
    CLEAR_BIT(LPTIM16x->CCSR, ((channel & 0x3) << 0xcU));
}

/**
  * @brief    Get Channel Input Digital Filter Enable Status
  * @rmtoll   CCSR        FL_LPTIM16_IsEnabledDigitalFilter
  * @param    LPTIM16x LPTIM16 instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_LPTIM16_IsEnabledDigitalFilter(LPTIM16_Type *LPTIM16x, uint32_t channel)
{
    return (uint32_t)(READ_BIT(LPTIM16x->CCSR, ((channel & 0x3) << 0xcU)) == ((channel & 0x3) << 0xcU));
}

/**
  * @brief    Set Channel 1 Input Prescaler
  * @rmtoll   CCSR    CAP1PSC    FL_LPTIM16_IC_WriteChannel1Prescaler
  * @param    LPTIM16x LPTIM16 instance
  * @param    psc
  * @retval   None
  */
__STATIC_INLINE void FL_LPTIM16_IC_WriteChannel1Prescaler(LPTIM16_Type *LPTIM16x, uint32_t psc)
{
    MODIFY_REG(LPTIM16x->CCSR, (0x3fU << 26U), (psc << 26U));
}

/**
  * @brief    Get Channel 1 Input Prescaler Setting
  * @rmtoll   CCSR    CAP1PSC    FL_LPTIM16_IC_ReadChannel1Prescaler
  * @param    LPTIM16x LPTIM16 instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_LPTIM16_IC_ReadChannel1Prescaler(LPTIM16_Type *LPTIM16x)
{
    return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x3fU << 26U)) >> 26U);
}

/**
  * @brief    Set Channel Operation Mode
  * @rmtoll   CCSR    CCS    FL_LPTIM16_SetChannelMode
  * @param    LPTIM16x LPTIM16 instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_MODE_DISABLE
  *           @arg @ref FL_LPTIM16_CHANNEL_MODE_INPUT
  *           @arg @ref FL_LPTIM16_CHANNEL_MODE_OUTPUT
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   None
  */
__STATIC_INLINE void FL_LPTIM16_SetChannelMode(LPTIM16_Type *LPTIM16x, uint32_t mode, uint32_t channel)
{
    switch(channel)
    {
        case FL_LPTIM16_CHANNEL_1:
            MODIFY_REG(LPTIM16x->CCSR, (0x3U << 0U), (mode << 0U));
            break;
        case FL_LPTIM16_CHANNEL_2:
            MODIFY_REG(LPTIM16x->CCSR, (0x3U << 2U), (mode << 2U));
            break;
    }
}

/**
  * @brief    Get Channel Operation Mode
  * @rmtoll   CCSR    CCS    FL_LPTIM16_GetChannelMode
  * @param    LPTIM16x LPTIM16 instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_MODE_DISABLE
  *           @arg @ref FL_LPTIM16_CHANNEL_MODE_INPUT
  *           @arg @ref FL_LPTIM16_CHANNEL_MODE_OUTPUT
  */
__STATIC_INLINE uint32_t FL_LPTIM16_GetChannelMode(LPTIM16_Type *LPTIM16x, uint32_t channel)
{
    switch(channel)
    {
        case FL_LPTIM16_CHANNEL_1:
            return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x3U << 0U)) >> 0U);
        case FL_LPTIM16_CHANNEL_2:
            return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x3U << 2U)) >> 2U);
        default:
            return 0;
    }
}

/**
  * @brief    Get Channel Captured Edge
  * @rmtoll   CCSR    CAPEDGE    FL_LPTIM16_IC_GetCapturedEdge
  * @param    LPTIM16x LPTIM16 instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_CHANNEL_1
  *           @arg @ref FL_LPTIM16_CHANNEL_2
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LPTIM16_IC_CAPCTURED_EDGE_RISING
  *           @arg @ref FL_LPTIM16_IC_CAPCTURED_EDGE_FALLING
  */
__STATIC_INLINE uint32_t FL_LPTIM16_IC_GetCapturedEdge(LPTIM16_Type *LPTIM16x, uint32_t channel)
{
    switch(channel)
    {
        case FL_LPTIM16_CHANNEL_1:
            return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 20U)) >> 0U);
        case FL_LPTIM16_CHANNEL_2:
            return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 21U)) >> 1U);
        default:
            return 0;
    }
}

/**
  * @brief    Set Channel 1 Capture Source
  * @rmtoll   CCSR    CAP1SSEL    FL_LPTIM16_IC_SetChannel1CaptureSource
  * @param    LPTIM16x LPTIM16 instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_GROUP0
  *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_GROUP1
  *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_GROUP2
  *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_GROUP3
  * @retval   None
  */
__STATIC_INLINE void FL_LPTIM16_IC_SetChannel1CaptureSource(LPTIM16_Type *LPTIM16x, uint32_t source)
{
    MODIFY_REG(LPTIM16x->CCSR, LPTIM16_CCSR_CAP1SSEL_Msk, source);
}

/**
  * @brief    Get Channel 1 Capture Source Setting
  * @rmtoll   CCSR    CAP1SSEL    FL_LPTIM16_IC_GetChannel1CaptureSource
  * @param    LPTIM16x LPTIM16 instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_GROUP0
  *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_GROUP1
  *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_GROUP2
  *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_GROUP3
  */
__STATIC_INLINE uint32_t FL_LPTIM16_IC_GetChannel1CaptureSource(LPTIM16_Type *LPTIM16x)
{
    return (uint32_t)(READ_BIT(LPTIM16x->CCSR, LPTIM16_CCSR_CAP1SSEL_Msk));
}

/**
  * @brief    Read LPTIM16 Counter Value
  * @rmtoll   CNT        FL_LPTIM16_ReadCounter
  * @param    LPTIM16x LPTIM16 instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_LPTIM16_ReadCounter(LPTIM16_Type *LPTIM16x)
{
    return (uint32_t)(READ_BIT(LPTIM16x->CNT, (0xffffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup LPTIM16_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_LPTIM16_DeInit(LPTIM16_Type *LPTIM16x);
FL_ErrorStatus FL_LPTIM16_Init(LPTIM16_Type *LPTIM16x, FL_LPTIM16_InitTypeDef *init);
void FL_LPTIM16_StructInit(FL_LPTIM16_InitTypeDef *init);
FL_ErrorStatus FL_LPTIM16_IC_Init(LPTIM16_Type *LPTIM16x, uint32_t channel, FL_LPTIM16_IC_InitTypeDef *ic_init);
void FL_LPTIM16_IC_StructInit(FL_LPTIM16_IC_InitTypeDef *ic_init);
FL_ErrorStatus FL_LPTIM16_OC_Init(LPTIM16_Type *LPTIM16x, uint32_t channel, FL_LPTIM16_OC_InitTypeDef *oc_init);
void FL_LPTIM16_OC_StructInit(FL_LPTIM16_OC_InitTypeDef *oc_init);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LG0XX_FL_LPTIM16_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2020-12-14*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
